/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: ช่วยให้สามารถเขียนโค้ดที่นำกลับมาใช้ใหม่ได้ง่ายขึ้น เช่น การเขียนฟังก์ชันที่รับพฤติกรรม (behavior) เป็นพารามิเตอร์ ทำให้เราสามารถกำหนดพฤติกรรมที่แตกต่างกันได้โดยไม่ต้องสร้างฟังก์ชันใหม่ทุกครั้ง


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer:ทำให้โค้ดอ่านง่ายขึ้นถ้าใช้ให้ถูกวิธี แต่ถ้ามี Callback ซ้อนกันมาก อาจทำให้โค้ดอ่านยากและควรใช้วิธีที่ดีกว่า โครงสร้างที่ชัดเจน: ฟังก์ชันที่เป็น callback มักจะทำให้โค้ดมีการแบ่งส่วนได้ชัดเจน ฟังก์ชันที่ส่งเป็น callback จะช่วยให้การแยกส่วนต่างๆ ของโค้ดสามารถจัดการได้ดีขึ้น (เช่น การทำงานที่ต้องเกิดขึ้นหลังจากการทำงานบางอย่างเสร็จ)
ซับซ้อนขึ้น:


3. หากต้องสอนเพื่อนให้เข้าใจ allback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  Callback → ฟังก์ชันที่ถูกส่งไปให้ฟังก์ชันอื่น แล้วเรียกใช้ภายหลัง
Higher-Order Function → ฟังก์ชันที่รับค่าที่ได้แล้วคืนค่าฟังก์ชัน


*/